loc uses labels(i.e index in case of rows and column name in columns),iloc uses integer value

In [2]:
import pandas as pd
import numpy as np

data=pd.DataFrame({
    "Name":["Alice","Dain","Stuart","Patrick","Ronald","Peter","Harry"],
    "Age":[19,23,21,24,20,21,22],
    "Place":["Delhi","Delhi","Mumbai","Goa","Hyderabad","Bangalore","Chennai"],
    "Branch":["CSE","CSE","EEE","ETC","CST","CSE","ETC"],
    "CourseApplied":["Python","DataScience","CloudComputing","Python","Hadoop","ML","Java"],
    "FeePaid":["Yes","Half","No","Yes","Half","No","Yes"]},
    index=[1,2,3,4,5,6,7]
    )

data

      Name  Age      Place Branch   CourseApplied FeePaid
1    Alice   19      Delhi    CSE          Python     Yes
2     Dain   23      Delhi    CSE     DataScience    Half
3   Stuart   21     Mumbai    EEE  CloudComputing      No
4  Patrick   24        Goa    ETC          Python     Yes
5   Ronald   20  Hyderabad    CST          Hadoop    Half
6    Peter   21  Bangalore    CSE              ML      No
7    Harry   22    Chennai    ETC            Java     Yes

In [43]:
data.loc[1:5,"Name"]

1      Alice
2       Dain
3     Stuart
4    Patrick
5     Ronald
Name: Name, dtype: object

In [44]:
data.iloc[1:5]

      Name  Age      Place Branch   CourseApplied FeePaid
2     Dain   23      Delhi    CSE     DataScience    Half
3   Stuart   21     Mumbai    EEE  CloudComputing      No
4  Patrick   24        Goa    ETC          Python     Yes
5   Ronald   20  Hyderabad    CST          Hadoop    Half

In [14]:
data.loc[1,"Name"]

'Alice'

In [45]:
data.loc[1:7,["Name","FeePaid"]]

      Name FeePaid
1    Alice     Yes
2     Dain    Half
3   Stuart      No
4  Patrick     Yes
5   Ronald    Half
6    Peter      No
7    Harry     Yes

In [46]:
data.loc[3:4,["Name","FeePaid"]]

      Name FeePaid
3   Stuart      No
4  Patrick     Yes

In [47]:
data.loc[data.Age>=20]

      Name  Age      Place Branch   CourseApplied FeePaid
2     Dain   23      Delhi    CSE     DataScience    Half
3   Stuart   21     Mumbai    EEE  CloudComputing      No
4  Patrick   24        Goa    ETC          Python     Yes
5   Ronald   20  Hyderabad    CST          Hadoop    Half
6    Peter   21  Bangalore    CSE              ML      No
7    Harry   22    Chennai    ETC            Java     Yes

In [48]:
data.loc[(data.Place=="Delhi") & (data.Branch=="CSE")]

    Name  Age  Place Branch CourseApplied FeePaid
1  Alice   19  Delhi    CSE        Python     Yes
2   Dain   23  Delhi    CSE   DataScience    Half

In [37]:
data.iloc[1:4,[0,3]]

      Name Branch
2     Dain    CSE
3   Stuart    EEE
4  Patrick    ETC

In [50]:
data.loc[(data.CourseApplied=='Python')&(data.FeePaid=="Yes")]

      Name  Age  Place Branch CourseApplied FeePaid
1    Alice   19  Delhi    CSE        Python     Yes
4  Patrick   24    Goa    ETC        Python     Yes

In [51]:
data.loc[(data.Branch=="CSE"),['CourseApplied']]=="Python"

   CourseApplied
1           True
2          False
6          False

In [9]:
data['CourseApplied']

1            Python
2       DataScience
3    CloudComputing
4            Python
5            Hadoop
6                ML
7              Java
Name: CourseApplied, dtype: object